// Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
//  попадає число(в першу, другу, третю чи четверту частину години).

// let time = +prompt('Введіть число від 0 до 59:');
// if (time <= 15) {
//     console.log('1 четверть');
// } else if (time >= 15 && time <= 30) {
//     console.log('2 четверть');
// } else if (time >= 30 && time <= 45) {
//     console.log('3 четверть');
// } else if (time >= 45 && time <= 59){
//     console.log('4 четверть');
// }else {
//     console.log("Що що?");
// }


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//

// let day = +prompt('Введіть число місяця:');
// if (day <= 10) {
//     console.log('Зараз перша декада місяця');
// } else if (day >= 11 && day <=20) {
//     console.log('Зараз друга декада місяця');
// } else if (day >= 21 && day <=30) {
//     console.log('Зараз третя декада місяця');
// } else {
//     console.log("Що що?");
// }



// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = 100;
// if (test === 100) {
//     console.log('Virno');
// } else {
//     console.log('Ne virno');
// }

// let test = 100;
// let check = test === 100 ? 'Virno' : 'Ne virno';
// console.log(check);
//
// let test2 = 1000;
// let check2 = test2 === 100 ? 'Virno' : 'Ne virno';
// console.log(check2);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = +prompt('Напишіть число 1, 0 або -3');
// if (a !== 0) {
//     console.log('Virno');
// } else {
//     console.log('Ne virno');
// }

// let a  = !0 ? 'Virno' : 'Ne virno';
// console.log(a)


// - Скласти розклад на тиждень за допомоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let number = +prompt('Введіть день тижня:')
// switch (number) {
//     case 1:
//         document.write('План на сьогодні: Не забути похавати');
//         break;
//     case 2:
//         document.write('План на сьогодні: Поспи, відпочинь');
//         break;
//     case 3:
//         document.write('План на сьогодні: Зробити дз');
//         break;
//     case 4:
//         document.write('План на сьогодні: Погуляти');
//         break;
//     case 5:
//         document.write('План на сьогодні: Покодити');
//         break;
//     case 6:
//         document.write('План на сьогодні: Прибрати кімнату');
//         break;
//     case 7:
//         document.write('План на сьогодні: Допомогти другу');
//         break;
//     default :
//         document.write('На цей день нічого не заплановано')
// }


// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt('Введіть рік щоб перевірити чи він високосний:');
// let text = year % 4;
// if (text === 0) {
//     console.log('Високосний');
// } else {
//     console.log('Не високосний');
// }

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: "Не знаєте? ECMAScript!"

// let name = prompt('Яка «офіційна» назва JavaScript?')
// if (name === 'ECMAScript') {
//     document.write('Правильно!');
// } else {
//     document.write('Не знаєте? ECMAScript!')
// }


//CLASSWORK ------------------------------- CLASSWORK --------------------

// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let number1 = +prompt('Введіть перше число:');
// let number2 = +prompt('Введіть друге число:');
// if (number1 > number2) {
//     console.log(number1);
// } else if (number1 === number2) {
//     console.log('Числа еквівалентні')
// } else if (number1 < number2) {
//     console.log(number2)
// }


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let entrance = +prompt('Введіть вашу квартиру');
// if (entrance < 21) {
//     console.log("Ваша квартира у першому під'їзді")
// } else if (entrance > 21 && entrance <48) {
//     console.log("Ваша квартира у другому під'їзді");
// } else if (entrance > 48 && entrance <=90) {
//     console.log("Ваша квартира у третьому під'їзді");
// }


// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Число кажи');
// if (number === 10) {
//     console.log('Correct')
// } else if (number !== 10) {
//     console.log("Incorrect")
// }


// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
// let x = typeof ({});
//     switch (x) {
//         case 'number':
//             console.log(1);
//         break;
//         case 'string':
//             console.log(2);
//             break;
//         case 'boolean':
//             console.log(-3);
//          break;
//          case 'object':
//              console.log(-4);
//             break;
//         default:
//             console.log("Undefined")
// }



// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temp = +prompt("Введіть температуру:");
// if (temp > 10 && temp < 22) {
//     console.log('Йдемо вчитися');
// } else {
//     console.log('Сидимо вдома і вчимося ОНЛАЙН');
// }


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let number = +prompt('Enter the number:');
// switch (number) {
//     case 1:
//         console.log('Avto');
//         break;
//     case 2:
//         console.log('Phone');
//         break;
//     case 3:
//         console.log('Apartment');
//         break;
//     case 4:
//         console.log('PC');
//         break;
//     case 5:
//         console.log('Cookie')
//         break;
//     default:
//         console.log('The number is incorrect')
// }

//ADDITIONAL -------------------------------- ADDITIONAL ---------------------



// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементів.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// let result = friends.length >= 3 ? 'Це великий масив, в якому  3 і більше елементів.' : 'Це маленький масив, в якому менше 3-х елементів';
// console.log(result)



// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let num1 = +prompt('Введіть перше число:');
// let num2 = +prompt('Введіть друге число:');
// let num3 = +prompt('Введіть третє число:');
// if (num1 > num2 && num1 < num3 || num1 < num2 && num1 > num3) {
//     console.log(num1);
// } else if (num3 > num1 && num3 < num2 || num3 < num1 && num3 > num2) {
//     console.log(num3);
// } else (
//     console.log(num2)
// );



// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = +prompt('Ведіть перше число:')
// let b = +prompt('Ведіть друге число:')
// let result = a + b < 4 ? 'Мало' : 'Багато';
// console.log(result)

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let number = +prompt('Введіть число від -100 до 100 для перевірки:');
// let check = number < 0 ? 'Негативне' : number > 0 ? 'Позитивне' : 'Нуль';
// console.log(check)


